Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz2_wbz45/apps/multiprotocol/ble_zigbee_light_prov_wbz450/firmware/src/packs/WBZ450_DFP/component/pmu.h
/* -------- PMU_PMUCFG : (PMU Offset: 0x38) (R/W 32)  -------- */
#define PMU_PMUCFG_RESETVALUE                 _UINT32_(0x00)                                       /*  (PMU_PMUCFG)   Reset Value */

#define PMU_PMUCFG_BUCK_SW_DELAY_Pos          _UINT32_(0)                                          /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_SW_DELAY_Msk          (_UINT32_(0x7F) << PMU_PMUCFG_BUCK_SW_DELAY_Pos)     /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_SW_DELAY(value)       (PMU_PMUCFG_BUCK_SW_DELAY_Msk & (_UINT32_(value) << PMU_PMUCFG_BUCK_SW_DELAY_Pos)) /* Assigment of value for BUCK_SW_DELAY in the PMU_PMUCFG register */
#define PMU_PMUCFG_MLDO_SW_DELAY_Pos          _UINT32_(8)                                          /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_MLDO_SW_DELAY_Msk          (_UINT32_(0x3F) << PMU_PMUCFG_MLDO_SW_DELAY_Pos)     /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_MLDO_SW_DELAY(value)       (PMU_PMUCFG_MLDO_SW_DELAY_Msk & (_UINT32_(value) << PMU_PMUCFG_MLDO_SW_DELAY_Pos)) /* Assigment of value for MLDO_SW_DELAY in the PMU_PMUCFG register */
#define PMU_PMUCFG_MLDOEXT_l_Pos              _UINT32_(14)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_MLDOEXT_l_Msk              (_UINT32_(0x3) << PMU_PMUCFG_MLDOEXT_l_Pos)          /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_MLDOEXT_l(value)           (PMU_PMUCFG_MLDOEXT_l_Msk & (_UINT32_(value) << PMU_PMUCFG_MLDOEXT_l_Pos)) /* Assigment of value for MLDOEXT_l in the PMU_PMUCFG register */
#define PMU_PMUCFG_BUCK_CP_L_Pos              _UINT32_(16)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_CP_L_Msk              (_UINT32_(0xF) << PMU_PMUCFG_BUCK_CP_L_Pos)          /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_CP_L(value)           (PMU_PMUCFG_BUCK_CP_L_Msk & (_UINT32_(value) << PMU_PMUCFG_BUCK_CP_L_Pos)) /* Assigment of value for BUCK_CP_L in the PMU_PMUCFG register */
#define PMU_PMUCFG_BUCK_CP_H_Pos              _UINT32_(20)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_BUCK_CP_H_Msk              (_UINT32_(0xF) << PMU_PMUCFG_BUCK_CP_H_Pos)          /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_BUCK_CP_H(value)           (PMU_PMUCFG_BUCK_CP_H_Msk & (_UINT32_(value) << PMU_PMUCFG_BUCK_CP_H_Pos)) /* Assigment of value for BUCK_CP_H in the PMU_PMUCFG register */
#define PMU_PMUCFG_ADC_CP_L_Pos               _UINT32_(24)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_ADC_CP_L_Msk               (_UINT32_(0xF) << PMU_PMUCFG_ADC_CP_L_Pos)           /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_ADC_CP_L(value)            (PMU_PMUCFG_ADC_CP_L_Msk & (_UINT32_(value) << PMU_PMUCFG_ADC_CP_L_Pos)) /* Assigment of value for ADC_CP_L in the PMU_PMUCFG register */
#define PMU_PMUCFG_ADC_CP_H_Pos               _UINT32_(28)                                         /* (PMU_PMUCFG)  Position */
#define PMU_PMUCFG_ADC_CP_H_Msk               (_UINT32_(0xF) << PMU_PMUCFG_ADC_CP_H_Pos)           /* (PMU_PMUCFG)  Mask */
#define PMU_PMUCFG_ADC_CP_H(value)            (PMU_PMUCFG_ADC_CP_H_Msk & (_UINT32_(value) << PMU_PMUCFG_ADC_CP_H_Pos)) /* Assigment of value for ADC_CP_H in the PMU_PMUCFG register */
#define PMU_PMUCFG_Msk                        _UINT32_(0xFFFFFF7F)                                 /* (PMU_PMUCFG) Register Mask  */


/* -------- PMU_WCMCMD : (PMU Offset: 0x3C) (R/W 32)  -------- */
#define PMU_WCMCMD_RESETVALUE                 _UINT32_(0x00)                                       /*  (PMU_WCMCMD)   Reset Value */

#define PMU_WCMCMD_WCMADDR_Pos                _UINT32_(0)                                          /* (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_WCMADDR_Msk                (_UINT32_(0x7FF) << PMU_WCMCMD_WCMADDR_Pos)          /* (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_WCMADDR(value)             (PMU_WCMCMD_WCMADDR_Msk & (_UINT32_(value) << PMU_WCMCMD_WCMADDR_Pos)) /* Assigment of value for WCMADDR in the PMU_WCMCMD register */
#define PMU_WCMCMD_WCMCLKDIV_Pos              _UINT32_(16)                                         /* (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_WCMCLKDIV_Msk              (_UINT32_(0x7) << PMU_WCMCMD_WCMCLKDIV_Pos)          /* (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_WCMCLKDIV(value)           (PMU_WCMCMD_WCMCLKDIV_Msk & (_UINT32_(value) << PMU_WCMCMD_WCMCLKDIV_Pos)) /* Assigment of value for WCMCLKDIV in the PMU_WCMCMD register */
#define PMU_WCMCMD_WCMRDU_Pos                 _UINT32_(28)                                         /* (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_WCMRDU_Msk                 (_UINT32_(0x1) << PMU_WCMCMD_WCMRDU_Pos)             /* (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_WCMRDU(value)              (PMU_WCMCMD_WCMRDU_Msk & (_UINT32_(value) << PMU_WCMCMD_WCMRDU_Pos)) /* Assigment of value for WCMRDU in the PMU_WCMCMD register */
#define PMU_WCMCMD_CMD_Pos                    _UINT32_(30)                                         /* (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_CMD_Msk                    (_UINT32_(0x1) << PMU_WCMCMD_CMD_Pos)                /* (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_CMD(value)                 (PMU_WCMCMD_CMD_Msk & (_UINT32_(value) << PMU_WCMCMD_CMD_Pos)) /* Assigment of value for CMD in the PMU_WCMCMD register */
#define PMU_WCMCMD_MODE_Pos                   _UINT32_(31)                                         /* (PMU_WCMCMD)  Position */
#define PMU_WCMCMD_MODE_Msk                   (_UINT32_(0x1) << PMU_WCMCMD_MODE_Pos)               /* (PMU_WCMCMD)  Mask */
#define PMU_WCMCMD_MODE(value)                (PMU_WCMCMD_MODE_Msk & (_UINT32_(value) << PMU_WCMCMD_MODE_Pos)) /* Assigment of value for MODE in the PMU_WCMCMD register */
#define PMU_WCMCMD_Msk                        _UINT32_(0xD00707FF)                                 /* (PMU_WCMCMD) Register Mask  */


/* -------- PMU_WCMWDATA : (PMU Offset: 0x40) (R/W 32)  -------- */
#define PMU_WCMWDATA_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_WCMWDATA)   Reset Value */

#define PMU_WCMWDATA_WCMWDATA_Pos             _UINT32_(0)                                          /* (PMU_WCMWDATA)  Position */
#define PMU_WCMWDATA_WCMWDATA_Msk             (_UINT32_(0xFFFFFFFF) << PMU_WCMWDATA_WCMWDATA_Pos)  /* (PMU_WCMWDATA)  Mask */
#define PMU_WCMWDATA_WCMWDATA(value)          (PMU_WCMWDATA_WCMWDATA_Msk & (_UINT32_(value) << PMU_WCMWDATA_WCMWDATA_Pos)) /* Assigment of value for WCMWDATA in the PMU_WCMWDATA register */
#define PMU_WCMWDATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PMU_WCMWDATA) Register Mask  */


